package com.example.du.deepPart;

import android.graphics.Bitmap;

/**
 * 
 * NK2023 Embedded System Design Body IV Design Deep Part
 * 
 * define some static constants for different class
 * 
 * 
 * @author achdu0000<achdu0000@163.com>
 * 
 */
public final class Constants {

	/**
	 * 注意控制蜂鸣器BEEP和LED等的电平信号有所差异
	 */
	public final static int BEEP_ON = 0;
	public final static int BEEP_OFF = 1;
	public final static int LED_ON = 1;
	public final static int LED_OFF = 0;
	public static final int DOT_DYNAMIC_UPDATE_FLAG = "DOT_DYNAMIC_UPDATE_FLAG".hashCode();
	/**
	 * 最简表模型动态刷新时间
	 */
	public static final long DOT_DYNAMIC_UPDATE_TIME = 1000;
	/**
	 * 设备状态正常的字符串
	 */
	public final static String STATE_NORMAL = "正常";
	/**
	 * 设备状态警告的字符串
	 */
	public final static String STATE_WARNING = "警告";
	/**
	 * 设备状态异常的字符串
	 */
	public final static String STATE_ERROR = "异常";

	/**
	 * Bitmap的基本配置
	 */
	public final static Bitmap.Config CONFIG = Bitmap.Config.ARGB_8888;

	/**
	 * 默认最高血压120
	 */
	public static final float ORIGIN_HIGHEST_HEART_PRESSURE = 120f;
	/**
	 * 默认最低血压80
	 */
	public static final float ORIGIN_LOWEST_HEART_PRESSURE = 80f;
	/**
	 * 默认初始化体温
	 */
	public static final float ORIGIN_BODY_TEMPERATURE = 36.5f;
	/**
	 * 初始化心率，默认为75%
	 */
	public static final int ORIGIN_HEART_RATE = 75;
	/**
	 * 环境温度，这里当做常量模拟输入
	 */
	public static final float ENVIRONMENT_TEMPERATURE = 20.1f;
//	/**
//	 * 设备温度的最高阈值50℃，高于则报警
//	 */
//	public static final float HIGEST_TEMPERATURE = 60;
//	/**
//	 * 设备温度的最低阈值-10℃，低于则报警
//	 */
//	public static final float LOWEST_TEMPERATURE = -20;
	/**
	 * 设备温度的高阈值1 50℃，高于则报警，屏幕熄灭，由点阵动态显示
	 */
	public static final float HIGE_TEMPERATURE = 50;
	/**
	 * 设备温度的高阈值2 60℃，高于则报警，由点阵静态最简显示
	 */
	public static final float HIGEST_TEMPERATURE = 60;
	/**
	 * 设备温度的最低阈值1 -10℃，低于则报警，由点阵动态显示
	 */
	public static final float LOW_TEMPERATURE = -10;
	/**
	 * 设备温度的最低阈值2 -20℃，低于则报警，由点阵静态最简显示
	 */
	public static final float LOWEST_TEMPERATURE = -20;
	
	/**
	 * 最简表模型动态指针对应的横坐标
	 */
	public static final int[][] DOT_CLOCK_POINTER_X = {{7,7,7,7},{9,10,11},{9,10,11,12},{9,10,11},{8,8,8,8},{6,5,4},{6,5,4,3},{6,5,4}};
	/**
	 * 最简表模型动态指针对应的纵坐标
	 */
	public static final int[][] DOT_CLOCK_POINTER_Y = {{6,5,4,3},{6,5,4},{7,7,7,7},{9,10,11},{9,10,11,12},{9,10,11},{8,8,8,8},{6,5,4}};
	
	/**
	 * 初始化剩余电量。默认为100%
	 */
	public static final int ORIGIN_REMIND_POWER = 100;
	/**
	 * 设备电量的提醒阈值，小于则警告
	 */
	public static final int WARNING_POWER = 5;

	/**
	 * 四个季节
	 */
	public static final String[] SEASON_STRING = { "春季", "夏季", "秋季", "冬季" };
	/**
	 * 春季的边界
	 */
	public static final float CHUN_FEN = 3.21f;
	/**
	 * 夏季的边界
	 */
	public static final float XIA_ZHI = 6.21f;
	/**
	 * 秋季的边界
	 */
	public static final float QIU_FEN = 9.21f;
	/**
	 * 冬季的边界
	 */
	public static final float DONG_ZHI = 12.21f;

	/**
	 * 二十四节气
	 */
	public static final String[] SOLAR_TERM_STRING = { "立春", "雨水", "惊蛰", "春分",
			"清明", "谷雨", "立夏", "小满", "芒种", "夏至", "小暑", "大暑", "立秋", "处暑", "白露",
			"秋分", "寒露", "霜降", "立冬", "小雪", "大雪", "冬至", "小寒", "大寒" };

	/**
	 * 十天干
	 */
	public static final String[] TEN_TIANGAN_STRING = { "甲", "乙", "丙", "丁",
			"戊", "己", "庚", "辛", "壬", "癸" };
	/**
	 * 十二地支
	 */
	public static final String[] TWELVE_DIZHI_STRING = { "子", "丑", "寅", "卯",
			"辰", "巳", "午", "未", "申", "酉", "戌", "亥" };
	/**
	 * 六十干支
	 */
	public static final String[] SIXTY_GANZHI_STRING = { "甲子", "乙丑", "丙寅",
			"丁卯", "戊辰", "己巳", "庚午", "辛未", "壬申", "癸酉", "甲戌", "乙亥", "丙子", "丁丑",
			"戊寅", "己卯", "庚辰", "辛巳", "壬午", "癸未", "甲申", "乙酉", "丙戌", "丁亥", "戊子",
			"己丑", "庚寅", "辛卯", "壬辰", "癸巳", "甲午", "乙未", "丙申", "丁酉", "戊戌", "己亥",
			"庚子", "辛丑", "壬寅", "癸卯", "甲辰", "乙巳", "丙午", "丁未", "戊申", "己酉", "庚戌",
			"辛亥", "壬子", "癸丑", "甲寅", "乙卯", "丙辰", "丁巳", "戊午", "己未", "庚申", "辛酉",
			"壬戌", "癸亥" };
	/**
	 * 时钟十二小时
	 */
	public final static String[] CLOCK_HOUR_STRINGS = { "12", "1", "2", "3",
		"4", "5", "6", "7", "8", "9", "10", "11" };
	/**
	 * 时钟二十四小时
	 */
	public final static String[] CLOCK_24HOUR_STRINGS = { "24", "1", "2", "3",
		"4", "5", "6", "7", "8", "9", "10", "11","12","13","14","15","16","17","18","19","20","21","22","23" };
	/**
	 * 时钟六十分钟
	 */
	public final static String[] CLOCK_MINUTE_STRINGS = { "60", "1", "2", "3",
		"4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", 
		"16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26",
		"27", "28", "29", "30", "31", "32", "33", "34", "35", "36", "37",
		"38", "39", "40", "41", "42", "43", "44", "45", "46", "47", "48",
		"49", "50", "51", "52", "53", "54", "55", "56", "57", "58", "59"};
	
	
	
	/**
	 * 十二时辰
	 */
	public static final String[] LUNAR_HOUR_STRINGS = { "子时", "丑时", "寅时", "卯时",
			"辰时", "巳时", "午时", "未时", "申时", "酉时", "戌时", "亥时" };
	
	/**
	 * 十二经络
	 */
	public static final String[] MERIDIAN_TERM_STRINGS={"足少阳胆经","足厥阴肝经","手太阴肺经",
														"手阳明大肠经","足阳明胃经","足太阴脾经",
														"手少阴心经","手太阳小肠经","足太阳膀胱经",
														"足少阴肾经","手厥阴心包经","手少阳三焦经"};
	/**
	 * 经络时附加信息
	 */
	public static final String[] MERIDIAN_ADD_STRINGS={"主治病候：本经腧穴主治侧头、目、耳、咽喉病，神志病，热病以及经脉循行部位的其他病证。如口苦，目眩，疟疾，头痛，颔痛，目外眦痛，缺盆部肿痛，腋下肿，胸、胁、股及下肢外侧痛，足外侧痛，足外侧发热等证。经穴分布：本经经穴分布在目外眦，颞部，耳后，肩部，胁肋，下肢外侧，膝外侧，外踝的前下方，足第四趾端等部位。起于瞳子髎，止于足窍阴，左右各44穴。",
													   "主治病候：本经腧穴主治肝病，妇科、前阴病以及经脉循行部位的其他病证。如腰痛，胸满，呃逆，遗尿，小便不利，疝气，少腹肿等证。经穴分布：本经经穴分布在足背，内踝前，胫骨内侧面，大腿内侧，前阴，胁肋等。起于大敦，止于期门，左右各14穴。",
													   "主治病候：本经腑穴主治喉、胸、肺病，以及经脉循行部位的其他病证。如咳嗽，气喘，少气不足以息，咳血，伤风，胸部胀满，咽喉肿痛，缺盆部及手臂内侧前缘痛，肩背寒冷、疼痛等证。经穴分布：本经经穴分布在胸部的外上方，上肢掌面桡侧和手掌及拇指的桡侧。起于中府，止于少商，左右各11个穴位。",
													   "主治病候：本经腧穴主治头面、五官疾患，热病，皮肤病，肠胃病，神智病及经脉循行部位的其他病证。如腹痛，腹鸣腹泻、大肠功能减弱、肩膀僵硬、皮肤无光泽、肩酸、喉干、喘息、宿便，腹胀、易便秘、易患痔疮、肩背部不适或疼痛、牙疼、皮肤异常、上脘异常等。经穴分布：手阳明大肠经经穴分布在上肢前外侧面、肩部、锁骨上窝、颈部、面部。起于商阳穴，止于迎香，左右各20穴。",
													   "主治病候：本经腧穴主治胃肠病、头面、目、鼻、口、齿痛、神志病及经脉循行部位的其他病证。如肠鸣腹胀，水肿，胃痛，呕吐或消谷善饥，口渴，咽喉肿痛，鼻衄，胸部及膝膑等本经循行部位疼痛，热病，发狂等病证。经穴分布：足阳明胃经经穴分布在头面部、颈部部、胸腹部、下肢的前外侧面。起于承泣，止于厉兑，左右各45穴。",
													   "主治病候：本经腧穴主治脾胃病，妇科，前阴病及经脉循行部位的其他病证。如胃脘痛，食则呕，嗳气，腹胀便溏，黄疸，身重无力，舌根强痛，下肢内侧肿胀，厥冷等。经穴分布：本经经穴分布在足大趾，内踝，下肢内侧，腹胸部第三侧线。起于隐白，止于大包，左右各21穴。",
													   "主治病候：本经腧穴主治心、胸、神志病以及经脉循行部位的其他病证。如心痛，咽干，口渴，目黄，胁痛，上臂内侧痛，手心发热等。经穴分布：本经经穴分布在腋下，上肢掌侧面的尺侧缘和小指的桡侧端。起于极泉，止于少冲，左右各9穴。",
													   "主治病候：本经腧穴主治头、项、耳、目、咽喉病，热病，神经病以及经脉循行部位的其他病证。如少腹痛，腰脊痛引睾丸，耳聋，目黄，颊肿，咽喉肿痛，肩臂外侧后缘痛等。经穴分布：本经经穴分布在指、掌尺侧、上肢背侧面的尺侧缘，肩胛及面部。起于少泽，止于听宫，左右各19穴。",
													   "主治病候：本经腧穴主治头、项、目、背、腰、下肢部病证以及神志病，背部第一侧线的背俞穴及第二侧线相平的腧穴，主治与其相关的脏腑病证和有关的组织器官病证。如小便不通，遗尿，癫狂，疟疾，目痛，迎风流泪，鼻塞多涕，鼻血丑，头痛，项、背、腰、臀部以及下肢后侧本经循行部位疼痛等证。经穴分布：本经经穴分布在眼眶，头，项，背腰部的脊柱两侧，下肢后外侧及小趾末端。起于睛明，止于至阴，左右各67穴。",
													   "主治病候：本经腧穴主治妇科，前阴病，肾、肺、咽喉病及经脉循行部位的其他病证。如：咳血，气喘，舌干，咽喉肿痛，水肿，大便秘结，泄泻，腰痛，脊股内后侧痛，痿弱无力，足心热等病证。经穴分布：本经经穴分布在足心，内踝后，跟腱前缘，下肢内侧后缘，腹部，胸部。起于涌泉，止于俞府，左右各27穴。",
													   "主治病候：本经腧穴主治心、胸、胃、神志病以及经脉循行部位的其他病证。如心痛，胸闷，心悸，心烦，癫狂，腋肿，肘臂挛急等证。经穴分布：本经经穴分布在乳旁，上胶掌侧面中间及中指末端。起于天池，止于中冲，左右各9穴。",
													   "主治病候：本经腧穴主治侧头、耳、目、胸胁、咽喉病，热病以及经脉循行部位的其他病证。如腹胀，水肿，遗尿，小便不利，耳鸣，耳聋，咽喉肿痛，目赤肿痛，颊肿，耳后、肩臂肘部外侧疼痛等证。经穴分布：本经穴分布在无名指外侧，手背，上肢外侧面中间，肩部，颈部，耳翼后缘，眉毛外端。起于关冲，止于丝竹空，左右各23穴。"};
	/**
	 * 十二穴位
	 */
	public final static String[] ACUPOINT_TERM_STRINGS={"从头走足","从足走腹","从胸走手",
		 												"从手走头","从头走足","从足走腹",
		 												"从胸走手","从手走头","从头走足",
		 												"从足走腹","从胸走手","从手走头"};
	/**
	 * 穴位时附加信息1
	 */
	public static final String[] ACUPOINT_ADD_STRINGS_A={"● 原穴：丘墟（在外踝的前下方）",
													   "● 原穴：太冲（在足背侧，当第1跖骨间隙的后方凹陷处）",
													   "● 原穴：太渊（腕横纹桡侧端，挠动脉挠侧凹陷中）",
													   "● 原穴：合谷（在手背，第1、2掌骨间，当第2掌骨挠侧的中点处）",
													   "● 原穴：冲阳（在足背，第2跖骨基底部与中间楔状骨关节处，可触及足背动脉）",
													   "● 原穴：太白（第1跖骨小头后缘，当赤白内际处）",
													   "● 原穴：丘墟（在外踝的前下方）",
													   "● 原穴：阳池（腕背横纹中）",
													   "● 原穴：大陵（仰掌，腕横纹上，挠侧腕屈肌腱与掌长肌腱之间）",
													   "● 络穴：外关（腕背横纹上2寸）",
													   "● 原穴：大陵（仰掌，腕横纹上，挠侧腕屈肌腱与掌长肌腱之间）",
													   "● 原穴：阳池（腕背横纹中）"};
	/**
	 * 穴位时附加信息2
	 */
	public static final String[] ACUPOINT_ADD_STRINGS_B={"● 络穴：光明（在小腿外侧，当外踝尖上5寸，腓骨前缘）",
													   "● 络穴：蠡沟（在小腿内侧，当足内踝尖上5寸，胫骨内侧面的中央）",
													   "● 络穴：列缺（腕横纹上1.5寸，前臂挠侧缘）",
													   "● 络穴：偏历（屈肘背面挠侧，腕横纹上3寸）",
													   "● 络穴：丰隆（小腿前外侧，当外踝尖上8寸，距胫骨前缘之横指）",
													   "● 络穴：公孙（当第1 跖骨基底部的前下方）",
													   "● 络穴：光明（在小腿外侧，当外踝尖上5寸，腓骨前缘）",
													   "● 络穴：支正（前臂背面R侧，腕背横纹上5寸）",
													   "● 络穴：内关（前臂掌侧，腕横纹上2寸）",
													   "● 络穴：外关（腕背横纹上2寸）",
													   "● 络穴：内关（前臂掌侧，腕横纹上2寸）",
													   "● 络穴：外关（腕背横纹上2寸）"};
	/**
	 * 穴位时附加信息3
	 */
	public static final String[] ACUPOINT_ADD_STRINGS_C={"● 输穴：足临泣（在足背外侧，第四趾关节的后方）",
													   "● 输穴：太冲（在足背侧，当第1跖骨间隙的后方凹陷处）",
													   "● 输穴：太渊（腕横纹桡侧端，挠动脉挠侧凹陷中）",
													   "● 输穴：三间（握拳，在第2掌骨小头挠侧后缘凹陷中）",
													   "● 输穴：陷谷（足背第2、3跖趾关节后凹陷中）",
													   "● 输穴：太白（第1跖骨小头后缘，当赤白内际处）",
													   "● 输穴：足临泣（在足背外侧，第四趾关节的后方）",
													   "● 输穴：中渚（握拳，手背第4、5掌骨小头后缘之间凹陷中）",
													   "● 输穴：大陵（仰掌，腕横纹上，挠侧腕屈肌腱与掌长肌腱之间）",
													   "● 输穴：中渚（握拳，手背第4、5掌骨小头后缘之间凹陷中）",
													   "● 输穴：大陵（仰掌，腕横纹上，挠侧腕屈肌腱与掌长肌腱之间）",
													   "● 输穴：中渚（握拳，手背第4、5掌骨小头后缘之间凹陷中）"};
	/**
	 * 线程控制常量，为了避免冲突造成歧义，由hash构造
	 */
	public static final int WATCH_TEMPERATURE_MONITOR_FLAG = "WATCH_TEMPERATURE_MONITOR_FLAG"
			.hashCode();
	/**
	 * 线程控制常量，为了避免冲突造成歧义，由hash构造
	 */
	public static final int REFRESH_UI_FLAG = "REFRESH_UI_FLAG"
			.hashCode();
	/**
	 * 线程控制常量，为了避免冲突造成歧义，由hash构造
	 */
	public static final int REFRESH_DOT_FLAG = "REFRESH_DOT_FLAG"
			.hashCode();

	/**
	 * 默认线程循环睡眠时间300ms，一直死循环而不睡眠太耗能且无必要
	 */
	public static final long DEFAULT_THREAD_SLEEP_TIME = 300;

	/**
	 * 默认线程循环睡眠时间1000ms 每秒钟更新一次
	 */
	public static final long REFRESH_THREAD_SLEEP_TIME = 1000;
	/**
	 * 默认线程循环睡眠时间1000ms 每7.5秒钟更新一次
	 */
	public static final long REFRESH_DOT_THREAD_SLEEP_TIME = 7500;
	/**
	 * 看门狗
	 */
	public static final long ERROR_THREAD_SLEEP_TIME = 3000;

}
